---
kind: method
id: M:Autodesk.Revit.DB.Electrical.DistributionSysTypeSetIterator.#ctor
source: html/8497d932-c504-2e50-e745-ea4d649177da.htm
---
# Autodesk.Revit.DB.Electrical.DistributionSysTypeSetIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public DistributionSysTypeSetIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.